### Load libraries

In [1]:
# Load libraries

import numpy as np
import pandas as pd

### Data creation
- Let's create a dummy dataset

In [2]:
data = pd.DataFrame({'gender': ['Male', 'Female', 'Female', 'Male', 'Female', 'Male'], 
             'exp_in_datascience': [1, 5, 3, 2, 4, 6],
             'exp_in_web_dev': [3, 2, 6, 1, 0, 4],
             'exp_in_software_eng': [0, 3, 2, 9, 3, 1]})
data

   gender  exp_in_datascience  exp_in_web_dev  exp_in_software_eng
0    Male                   1               3                    0
1  Female                   5               2                    3
2  Female                   3               6                    2
3    Male                   2               1                    9
4  Female                   4               0                    3
5    Male                   6               4                    1

In [3]:
data.shape

(6, 4)

### map
- map values of a series

In [4]:
gender_mapper = {'Male': 0, 'Female': 1}

In [5]:
pd.Series(gender_mapper)

Male      0
Female    1
dtype: int64

In [8]:
data['gender'].map(pd.Series(gender_mapper))

0    0
1    1
2    1
3    0
4    1
5    0
Name: gender, dtype: int64

In [9]:
data['gender'] = data['gender'].map(gender_mapper)
data.head()

   gender  exp_in_datascience  exp_in_web_dev  exp_in_software_eng
0       0                   1               3                    0
1       1                   5               2                    3
2       1                   3               6                    2
3       0                   2               1                    9
4       1                   4               0                    3

### apply
- Apply a function along an axis of the DataFrame
    - axis=0: apply function to each column
    - axis=1: apply function to each row

In [10]:
def calculate_total_experience(row):
    total_experience = row['exp_in_datascience'] + row['exp_in_web_dev'] + row['exp_in_software_eng']
    return total_experience

In [11]:
data.apply(calculate_total_experience, axis=1)

0     4
1    10
2    11
3    12
4     7
5    11
dtype: int64

In [12]:
data['total_experience'] = data.apply(calculate_total_experience, axis=1)
data.head()

,gender,exp_in_datascience,exp_in_web_dev,exp_in_software_eng,total_experience
0,0,1,3,0,4
1,1,5,2,3,10
2,1,3,6,2,11
3,0,2,1,9,12
4,1,4,0,3,7

In [13]:
# If you want to add the values in each column and create a total column, then you can use axis=0

def add_everything(column):
    return column.sum()

In [14]:
data.apply(add_everything, axis=0)

gender                  3
exp_in_datascience     21
exp_in_web_dev         16
exp_in_software_eng    18
total_experience       55
dtype: int64

In [15]:
data.loc['sum'] = data.apply(add_everything, axis=0)
data

,gender,exp_in_datascience,exp_in_web_dev,exp_in_software_eng,total_experience
0,0,1,3,0,4
1,1,5,2,3,10
2,1,3,6,2,11
3,0,2,1,9,12
4,1,4,0,3,7
5,0,6,4,1,11
sum,3,21,16,18,55

### applymap
- Apply a function to a Dataframe elementwise.

In [16]:
def add_two(element):
    return element + 2

In [17]:
data.applymap(add_two)

,gender,exp_in_datascience,exp_in_web_dev,exp_in_software_eng,total_experience
0,2,3,5,2,6
1,3,7,4,5,12
2,3,5,8,4,13
3,2,4,3,11,14
4,3,6,2,5,9
5,2,8,6,3,13
sum,5,23,18,20,57

In [18]:
sample_data = pd.DataFrame({'name': ['abhi', 'ramu', 'chandu'], 'fathers_name': ['ram', 'ravi', 'charan']})
sample_data

     name fathers_name
0    abhi          ram
1    ramu         ravi
2  chandu       charan

In [19]:
sample_data.applymap(lambda x: len(str(x)))

   name  fathers_name
0     4             3
1     4             4
2     6             6

### That's it for this video
- Please do like, share and subscribe to my channel :)